Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_ДокументыОбменаПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция КолонкиТабличнойЧасти(ТипТаблицы) Экспорт
	
	Колонки = Новый Соответствие();
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		МетаданныеТЧ = Метаданные.Документы.SUI_ДокументОбмена.ТабличныеЧасти.Товары;
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		МетаданныеТЧ = Метаданные.Документы.SUI_ДокументОбмена.ТабличныеЧасти.ШтрихкодыУпаковок;
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		МетаданныеТЧ = Метаданные.Документы.SUI_ДокументОбмена.ТабличныеЧасти.Серии;
	Иначе
		МетаданныеТЧ = Неопределено;
	КонецЕсли;
	
	Если МетаданныеТЧ <> Неопределено Тогда
		
		Для Каждого МетаданныеРеквизитаТЧ Из МетаданныеТЧ.Реквизиты Цикл
			
			ОписаниеКолонки = Новый Структура();
			ОписаниеКолонки.Вставить("Синоним", МетаданныеРеквизитаТЧ.Синоним);
			ОписаниеКолонки.Вставить("Тип", МетаданныеРеквизитаТЧ.Тип);
			
			Колонки.Вставить(МетаданныеРеквизитаТЧ.Имя, ОписаниеКолонки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(Колонки);
	
КонецФункции

#КонецОбласти
